var data = {
  'code': '0',
  'message': '0',
  'data': {
    'shelf': {
      'count': '19',
      'items': [
        {
          'name': '莱恩王国之剑',
          'hq': '1',
          'count': '1',
          'price': '123455666',
        },
        {
          'name': '莱恩王国之剑',
          'hq': '1',
          'count': '1',
          'price': '1234555',
        },
        {
          'name': '莱恩王国之剑',
          'hq': '1',
          'count': '1',
          'price': '12312312',
        },
        {
          'name': '莱恩王国之剑',
          'hq': '1',
          'count': '3',
          'price': '444444',
        },
        {
          'name': '莱恩王国之剑',
          'hq': '1',
          'count': '999',
          'price': '1233333',
        },
      ]
    },
    'store': {
      'count' : '192',
      'items': [
        {
          'name': '莱恩王国之剑',
          'hq': '1',
          'count': '12',
        },
        {
          'name': '莱恩王国之剑',
          'hq': '1',
          'count': '5',
        },
        {
          'name': '莱恩王国之剑',
          'hq': '1',
          'count': '999',
        },
        {
          'name': '莱恩王国之剑',
          'hq': '1',
          'count': '8',
        },
        {
          'name': '莱恩王国之剑',
          'hq': '1',
          'count': '12',
        },
        {
          'name': '莱恩王国之剑',
          'hq': '1',
          'count': '10',
        },
         {
          'name': '莱恩王国之剑',
          'hq': '1',
          'count': '10',
        },
         {
          'name': '莱恩王国之剑',
          'hq': '1',
          'count': '10',
        },
         {
          'name': '莱恩王国之剑',
          'hq': '1',
          'count': '10',
        },
         {
          'name': '莱恩王国之剑',
          'hq': '1',
          'count': '10',
        },
         {
          'name': '莱恩王国之剑',
          'hq': '1',
          'count': '10',
        }
      ]
    }
  }
};
